### DataFrame 연산 - 3
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행 가능

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'A':[98, 78, np.nan, 52],
        'B':[90, 70, 10, 50]}

In [3]:
df1 = pd.DataFrame(data)
df1

      A   B
0  98.0  90
1  78.0  70
2   NaN  10
3  52.0  50

In [4]:
# 연산 수행
# DataFrame 숫자
df1.add(5, fill_value=0)

       A   B
0  103.0  95
1   83.0  75
2    5.0  15
3   57.0  55

In [8]:
# DataFrame + DataFrame
df1.add(df1+10, fill_value=-10)    # 한쪽만 바꿔서 계산한다고 봄

       A    B
0  206.0  190
1  166.0  150
2    NaN   30
3  114.0  110

In [9]:
df1.add(df1+10, axis=1)

       A    B
0  206.0  190
1  166.0  150
2    NaN   30
3  114.0  110

In [13]:
df2 = pd.DataFrame(data = {'A':[98, 78, 20, 52],
        'B':[90, 70, 10, 50]})

In [14]:
df2

    A   B
0  98  90
1  78  70
2  20  10
3  52  50

In [15]:
df1+df2

       A    B
0  196.0  180
1  156.0  140
2    NaN   20
3  104.0  100

In [17]:
df1.add(df2, fill_value=0)  # 양쪽 다 결치치라면 어느 쪽이든 값을 채워도 의미가 없음.

       A    B
0  196.0  180
1  156.0  140
2   20.0   20
3  104.0  100

In [19]:
sr1 = df1.A

In [20]:
sr1.T

0    98.0
1    78.0
2     NaN
3    52.0
Name: A, dtype: float64

In [21]:
sr1_T = sr1.T
print(sr1_T)

0    98.0
1    78.0
2     NaN
3    52.0
Name: A, dtype: float64

In [22]:
sr1_T + df1 # 왜 난 시리즈 전치가 안되누...

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN